## Reading Excel into a pandas DataFrame

In [3]:
import pandas as pd

df = pd.read_excel("data/data.xlsx")
df

   id    name  age        country
0   1  Thomas   36        Germany
1   2  Lothar   48        Germany
2   3  Andrew   21  United States
3   4    John   44       Scotland

## Reading Excel into a pandas DataFrame and setting Index

In [4]:
df = pd.read_excel("data.xlsx", index_col=0)
df

      name  age        country
id
1   Thomas   36        Germany
2   Lothar   48        Germany
3   Andrew   21  United States
4     John   44       Scotland